docs/SF2900.md

# SF2900: Fordelingskomponenten

<https://digitaliseringskataloget.dk/integration/sf2900>

> Servicen er udstillet med følgende sikkerhedsmodeller:
>
> - AuthorityContext
> - SAML-token

(<https://digitaliseringskataloget.dk/integration/sf2900>)

## `FordelingsmodtagerList`

Example request:

``` shell name=test-FordelingsmodtagerList
curl https://exttest.serviceplatformen.dk/service/SP/Distribution/3 \
    --cert-type p12 \
    --cert '«path to your certificate»:«certificate password»' \
    --header 'content-type: text/xml;charset=UTF-8' \
    --data @- <<'XML'
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:typ="http://serviceplatformen.dk/xml/wsdl/soap11/DistributionService/3/types" xmlns:ns="http://serviceplatformen.dk/xml/schemas/CallContext/1/" xmlns:ns1="http://serviceplatformen.dk/xml/schemas/AuthorityContext/1/" xmlns:typ1="http://serviceplatformen.dk/xml/wsdl/soap11/DistributionService/2/types">
   <soapenv:Header/>
   <soapenv:Body>
      <typ:FordelingsmodtagerListRequest>
         <ns1:AuthorityContext>
            <ns1:MunicipalityCVR>55133018</ns1:MunicipalityCVR>
         </ns1:AuthorityContext>
         <typ:Routing>
            <typ1:AfsendendeMyndighed>55133018</typ1:AfsendendeMyndighed>
            <typ1:RoutingMyndighed>👻</typ1:RoutingMyndighed>
            <typ1:RoutingKLEEmne>01.01.01</typ1:RoutingKLEEmne>
            <!--<typ1:RoutingHandlingFacet></typ1:RoutingHandlingFacet>-->
         </typ:Routing>
      </typ:FordelingsmodtagerListRequest>
   </soapenv:Body>
</soapenv:Envelope>
XML
```

Response:

``` xml
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
  <soap:Body>
    <ns4:FordelingsmodtagerListResponse xmlns="http://serviceplatformen.dk/xml/schemas/CallContext/1/" xmlns:ns2="http://serviceplatformen.dk/xml/schemas/AuthorityContext/1/" xmlns:ns3="http://serviceplatformen.dk/xml/wsdl/soap11/DistributionService/2/types" xmlns:ns4="http://serviceplatformen.dk/xml/wsdl/soap11/DistributionService/3/types">
      <ns4:Systemer>
        <ns3:System>
          <ns3:SystemUUID>👻</ns3:SystemUUID>
          <ns3:SystemNavn>fordelingskomponent-itkdev.aarhuskommune.dk</ns3:SystemNavn>
          <ns3:RoutingKLEEmne>01.01.*</ns3:RoutingKLEEmne>
          <ns3:RoutingHandlingFacet>A00</ns3:RoutingHandlingFacet>
        </ns3:System>
      </ns4:Systemer>
    </ns4:FordelingsmodtagerListResponse>
  </soap:Body>
</soap:Envelope>
```
